---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyTime
source: html/bb1e47c2-cb9b-b03b-30ca-4a32b0309a93.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyTime

Represents a connected property of material.

## Syntax (C#)
```csharp
public class AssetPropertyTime : AssetProperty
```